[{
    "_id": "64301166f5a7e52ce1e8fa69",
    "name": "Sophia Brown",
    "details": "Yousra's Hub is a hidden gem for Halal food enthusiasts. The ambiance is cozy, and the Chicken Over Rice is a flavor explosion. The attention to detail in every dish sets this place apart. Definitely my top pick.",
    "rating": 5
  },
    
    {
      "_id": "6430113df5a7e52ce1e8fa67",
      "name": "Emily Johnson",
      "details": "Yousra's Delightful Hub is a true delight for the senses. The ambiance is warm, and the menu caters to various tastes. The CravingsHub platter is perfect for sharing and gives a delightful sampling of their diverse offerings. Can't wait to return!",
      "rating": 4.2
    },
    {
      "_id": "64301153f5a7e52ce1e8fa68",
      "name": "Michael Davis",
      "details": "A culinary journey awaits at Yousra's Hub! The Thai Soup is a comforting delight, and the diversity in their menu is impressive. The staff's knowledge of the dishes adds a personal touch to the dining experience. Highly recommended!",
      "rating": 4.5
    },
    
    {
      "_id": "6430117af5a7e52ce1e8fa6a",
      "name": "Matthew Miller",
      "details": "Yousra's Delightful Hub is a culinary masterpiece. The Borhani is a refreshing drink that complements the rich flavors of the main courses. The attention to quality and the welcoming staff make it a favorite spot for family dinners.",
      "rating": 4.8
    },
    {
      "_id": "64301188f5a7e52ce1e8fa6b",
      "name": "Olivia White",
      "details": "I love the diverse menu at Yousra's Hub. The staff is attentive, and the dishes are consistently delicious. Whether you're craving savory or sweet, they have something for everyone. Can't get enough of their delightful offerings!",
      "rating": 4.4
    },
    {
      "_id": "643011a0f5a7e52ce1e8fa6c",
      "name": "Daniel Wilson",
      "details": "Yousra's Delightful Hub offers a fantastic fusion of tradition and innovation. The Beef Kebabs are a standout – juicy and perfectly seasoned. The cozy atmosphere and top-notch service make it a favorite spot for me and my friends.",
      "rating": 4.5
    },
    {
      "_id": "643011b5f5a7e52ce1e8fa6d",
      "name": "Ava Robinson",
      "details": "TAs a fan of Halal cuisine, Yousra's Hub exceeded my expectations. The Chicken Biryani is aromatic and flavorful, a true delight for the taste buds. The staff's hospitality adds a personal touch to the dining experience",
      "rating": 5
    },
    {
      "_id": "643011caf5a7e52ce1e8fa6e",
      "name": "Ethan Harris",
      "details": "A delightful experience! Yousra's Hub serves up the most delicious and authentic dishes. The Tandoori Chicken is a must-try – perfectly spiced and cooked to perfection. The warm ambiance and friendly staff make every visit memorable.",
      "rating": 4.7
    },
    {
        "_id": "643011f4f5a7e52ce1e8fa70",
        "name": "Mason Taylor",
        "details": "Yousra's Delightful Hub is my go-to place for a culinary adventure. The variety of flavors in their menu is impressive. I highly recommend the Rosmalai for dessert – it's a sweet treat that melts in your mouth. 5 stars!",
        "rating": 5
      }
  ]
  